MyTreesCode/app/Models/ArbolesModel.php

    public function obtenerArbolesDisponibles()
    {
        return $this->select('arboles.id, especies.nombre_comercial AS especie, arboles.ubicacion_geografica, arboles.precio')
                    ->join('especies', 'arboles.especie_id = especies.id')
                    ->where('arboles.estado', 'Disponible')
                    ->findAll();
---
SELECT `arboles`.`id`, `especies`.`nombre_comercial` AS `especie`, `arboles`.`ubicacion_geografica`, `arboles`.`precio`
FROM `arboles`
JOIN `especies` ON `arboles`.`especie_id` = `especies`.`id`
WHERE `arboles`.`estado` = 'Disponible'