MyTreesCode/app/Models/DashboardModel.php

SELECT COUNT(*) AS `numrows`
FROM `usuarios`
WHERE `rol` = 'amigo'
---
    public function getAmigosRegistrados()
    {
        return $this->db->table('usuarios')
                        ->where('rol', 'amigo')
                        ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `arboles`
WHERE `estado` = 'Disponible'
---
    public function getArbolesDisponibles()
    {
        return $this->db->table('arboles')
                        ->where('estado', 'Disponible')
                        ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `arboles`
WHERE `estado` = 'Vendido'
---
    public function getArbolesVendidos()
    {
        return $this->db->table('arboles')
                        ->where('estado', 'Vendido')
                        ->countAllResults();