MyTreesCode/app/Models/UsuariosModel.php

    public function verificarCredenciales($correo, $password)
    {
        // Obtiene el usuario por correo
        $usuario = $this->where('correo', $correo)->first();
---
SELECT *
FROM `usuarios`
WHERE `correo` = '4@gmail.com'
 LIMIT 1